log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** What is New in Cross Compiling Haskell
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-07-06-what-is-new-in-cross-compiling-haskell
   :EXPORT_DATE: <2017-07-06>
   :ID:       21257468-66A9-4399-9D2B-D88C5D39FA48
   :END:

*** June Edition
    :PROPERTIES:
    :ID:       13D62813-1041-4311-8ABB-7BB96FA4788E
    :END:

After building the cross compilers Raspberry Pi and Android in
[[https://medium.com/@zw3rk/what-is-new-in-cross-compiling-haskell-1249881317d5][May]],
June was only about iOS, as I've been traveling quite a bit in June.

*** Building a Cross Compiler for iOS
    :PROPERTIES:
    :ID:       5733F62B-6BFC-412B-9B68-14B955C46ECC
    :END:

- [[https://medium.com/@zw3rk/a-haskell-cross-compiler-for-ios-7cc009abe208][A
  Haskell Cross Compiler for iOS]]
- [[https://medium.com/@zw3rk/ios-and-template-haskell-6305c105b354][iOS
  and Template Haskell]]

I hope you enjoyed the posts and are excited for more! As always you can
follow us here on medium, on [[https://github.com/zw3rk][github]], or on
[[http://twitter.com/zw3rktech][twitter]].

