content/posts/what-is-new-in-cross-compiling-haskell.md
+++
title = "What is New in Cross Compiling Haskell"
date = 2017-07-06T00:00:00+08:00
draft = false
author = "Moritz"
+++

## June Edition {#june-edition}

After building the cross compilers Raspberry Pi and Android in
[May](https://medium.com/@zw3rk/what-is-new-in-cross-compiling-haskell-1249881317d5),
June was only about iOS, as I've been traveling quite a bit in June.


## Building a Cross Compiler for iOS {#building-a-cross-compiler-for-ios}

-   [A
    Haskell Cross Compiler for iOS](https://medium.com/@zw3rk/a-haskell-cross-compiler-for-ios-7cc009abe208)
-   [iOS
    and Template Haskell](https://medium.com/@zw3rk/ios-and-template-haskell-6305c105b354)

I hope you enjoyed the posts and are excited for more! As always you can
follow us here on medium, on [github](https://github.com/zw3rk), or on
[twitter](http://twitter.com/zw3rktech).